doc/resources/benchmark_sysbench/threads4_sysbench-tpcc-proxysql.txt
 date +%FT%TZ; \
> ./tpcc.lua --mysql-host=* --mysql-port=* --mysql-user=* --mysql-password=* \
> --mysql-db=sbt --report-interval=10 --tables=8 --scale=400 --db-driver=mysql --time=900 --threads=4  run; \
> date +%FT%TZ;
2020-04-27T02:31:34Z
sysbench 1.0.19 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 4
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 4 tps: 103.78 qps: 2985.93 (r/w/o: 1355.39/1421.38/209.17) lat (ms,95%): 75.82 err/s 0.30 reconn/s: 0.00
[ 20s ] thds: 4 tps: 96.60 qps: 2685.53 (r/w/o: 1221.42/1270.92/193.20) lat (ms,95%): 142.39 err/s 0.40 reconn/s: 0.00
[ 30s ] thds: 4 tps: 104.00 qps: 2902.22 (r/w/o: 1321.11/1373.11/208.00) lat (ms,95%): 77.19 err/s 0.60 reconn/s: 0.00
[ 40s ] thds: 4 tps: 91.30 qps: 2737.90 (r/w/o: 1248.60/1306.70/182.60) lat (ms,95%): 112.67 err/s 0.40 reconn/s: 0.00
[ 50s ] thds: 4 tps: 101.90 qps: 2809.60 (r/w/o: 1279.50/1326.30/203.80) lat (ms,95%): 80.03 err/s 0.60 reconn/s: 0.00
[ 60s ] thds: 4 tps: 95.70 qps: 2717.60 (r/w/o: 1241.10/1285.10/191.40) lat (ms,95%): 114.72 err/s 0.30 reconn/s: 0.00
[ 70s ] thds: 4 tps: 102.60 qps: 2970.29 (r/w/o: 1357.99/1407.09/205.20) lat (ms,95%): 77.19 err/s 0.40 reconn/s: 0.00
[ 80s ] thds: 4 tps: 96.10 qps: 2810.71 (r/w/o: 1283.21/1335.31/192.20) lat (ms,95%): 106.75 err/s 0.50 reconn/s: 0.00
[ 90s ] thds: 4 tps: 96.20 qps: 2815.00 (r/w/o: 1283.80/1338.80/192.40) lat (ms,95%): 81.48 err/s 0.50 reconn/s: 0.00
[ 100s ] thds: 4 tps: 97.70 qps: 2818.20 (r/w/o: 1286.50/1336.30/195.40) lat (ms,95%): 95.81 err/s 0.60 reconn/s: 0.00
[ 110s ] thds: 4 tps: 104.20 qps: 2937.60 (r/w/o: 1338.80/1390.40/208.40) lat (ms,95%): 78.60 err/s 0.90 reconn/s: 0.00
[ 120s ] thds: 4 tps: 99.10 qps: 2770.20 (r/w/o: 1263.00/1309.00/198.20) lat (ms,95%): 110.66 err/s 0.30 reconn/s: 0.00
[ 130s ] thds: 4 tps: 101.20 qps: 2896.90 (r/w/o: 1320.00/1374.50/202.40) lat (ms,95%): 75.82 err/s 0.20 reconn/s: 0.00
[ 140s ] thds: 4 tps: 98.00 qps: 2709.50 (r/w/o: 1236.10/1277.40/196.00) lat (ms,95%): 114.72 err/s 0.40 reconn/s: 0.00
[ 150s ] thds: 4 tps: 94.80 qps: 2871.50 (r/w/o: 1313.20/1368.70/189.60) lat (ms,95%): 81.48 err/s 0.80 reconn/s: 0.00
[ 160s ] thds: 4 tps: 95.20 qps: 2729.50 (r/w/o: 1244.80/1294.40/190.30) lat (ms,95%): 127.81 err/s 0.50 reconn/s: 0.00
[ 170s ] thds: 4 tps: 97.00 qps: 2753.49 (r/w/o: 1264.20/1295.20/194.10) lat (ms,95%): 82.96 err/s 0.40 reconn/s: 0.00
[ 180s ] thds: 4 tps: 100.40 qps: 2898.00 (r/w/o: 1318.90/1378.30/200.80) lat (ms,95%): 81.48 err/s 0.10 reconn/s: 0.00
[ 190s ] thds: 4 tps: 106.40 qps: 3056.09 (r/w/o: 1400.00/1443.30/212.80) lat (ms,95%): 74.46 err/s 0.70 reconn/s: 0.00
[ 200s ] thds: 4 tps: 96.60 qps: 2775.01 (r/w/o: 1266.61/1315.21/193.20) lat (ms,95%): 89.16 err/s 0.70 reconn/s: 0.00
[ 210s ] thds: 4 tps: 99.50 qps: 2859.20 (r/w/o: 1303.30/1356.90/199.00) lat (ms,95%): 95.81 err/s 0.50 reconn/s: 0.00
[ 220s ] thds: 4 tps: 100.00 qps: 2769.80 (r/w/o: 1265.40/1304.40/200.00) lat (ms,95%): 82.96 err/s 0.20 reconn/s: 0.00
[ 230s ] thds: 4 tps: 101.60 qps: 2848.21 (r/w/o: 1300.50/1344.50/203.20) lat (ms,95%): 80.03 err/s 0.80 reconn/s: 0.00
[ 240s ] thds: 4 tps: 96.00 qps: 2837.69 (r/w/o: 1298.20/1347.50/192.00) lat (ms,95%): 81.48 err/s 0.60 reconn/s: 0.00
[ 250s ] thds: 4 tps: 103.60 qps: 2815.70 (r/w/o: 1281.60/1326.90/207.20) lat (ms,95%): 78.60 err/s 0.40 reconn/s: 0.00
[ 260s ] thds: 4 tps: 97.90 qps: 2764.30 (r/w/o: 1259.80/1308.70/195.80) lat (ms,95%): 137.35 err/s 0.40 reconn/s: 0.00
[ 270s ] thds: 4 tps: 96.60 qps: 2701.00 (r/w/o: 1234.20/1273.60/193.20) lat (ms,95%): 112.67 err/s 0.60 reconn/s: 0.00
[ 280s ] thds: 4 tps: 96.80 qps: 2858.00 (r/w/o: 1305.10/1359.30/193.60) lat (ms,95%): 84.47 err/s 0.30 reconn/s: 0.00
[ 290s ] thds: 4 tps: 103.60 qps: 2920.89 (r/w/o: 1331.59/1382.09/207.20) lat (ms,95%): 75.82 err/s 0.10 reconn/s: 0.00
[ 300s ] thds: 4 tps: 103.00 qps: 2879.11 (r/w/o: 1311.40/1361.71/206.00) lat (ms,95%): 74.46 err/s 0.50 reconn/s: 0.00
[ 310s ] thds: 4 tps: 102.00 qps: 2890.40 (r/w/o: 1317.60/1368.80/204.00) lat (ms,95%): 78.60 err/s 0.40 reconn/s: 0.00
[ 320s ] thds: 4 tps: 98.70 qps: 2791.50 (r/w/o: 1274.80/1319.30/197.40) lat (ms,95%): 106.75 err/s 0.50 reconn/s: 0.00
[ 330s ] thds: 4 tps: 100.20 qps: 2882.81 (r/w/o: 1319.80/1362.60/200.40) lat (ms,95%): 78.60 err/s 0.70 reconn/s: 0.00
[ 340s ] thds: 4 tps: 96.60 qps: 2776.20 (r/w/o: 1264.20/1318.80/193.20) lat (ms,95%): 147.61 err/s 0.30 reconn/s: 0.00
[ 350s ] thds: 4 tps: 94.10 qps: 2733.20 (r/w/o: 1246.00/1299.00/188.20) lat (ms,95%): 153.02 err/s 0.30 reconn/s: 0.00
[ 360s ] thds: 4 tps: 103.80 qps: 2851.39 (r/w/o: 1296.70/1347.10/207.60) lat (ms,95%): 81.48 err/s 0.30 reconn/s: 0.00
[ 370s ] thds: 4 tps: 101.40 qps: 2862.81 (r/w/o: 1300.20/1359.80/202.80) lat (ms,95%): 77.19 err/s 0.30 reconn/s: 0.00
[ 380s ] thds: 4 tps: 99.20 qps: 2847.51 (r/w/o: 1299.81/1349.31/198.40) lat (ms,95%): 80.03 err/s 0.50 reconn/s: 0.00
[ 390s ] thds: 4 tps: 95.20 qps: 2741.69 (r/w/o: 1248.99/1302.29/190.40) lat (ms,95%): 137.35 err/s 0.40 reconn/s: 0.00
[ 400s ] thds: 4 tps: 101.30 qps: 2802.51 (r/w/o: 1276.60/1323.30/202.60) lat (ms,95%): 102.97 err/s 0.40 reconn/s: 0.00
[ 410s ] thds: 4 tps: 98.60 qps: 2874.99 (r/w/o: 1308.70/1369.10/197.20) lat (ms,95%): 81.48 err/s 0.90 reconn/s: 0.00
[ 420s ] thds: 4 tps: 106.20 qps: 2871.91 (r/w/o: 1309.80/1349.70/212.40) lat (ms,95%): 75.82 err/s 0.30 reconn/s: 0.00
[ 430s ] thds: 4 tps: 103.20 qps: 2802.20 (r/w/o: 1278.60/1317.20/206.40) lat (ms,95%): 80.03 err/s 0.10 reconn/s: 0.00
[ 440s ] thds: 4 tps: 100.10 qps: 2828.79 (r/w/o: 1289.49/1339.09/200.20) lat (ms,95%): 89.16 err/s 0.60 reconn/s: 0.00
[ 450s ] thds: 4 tps: 99.00 qps: 2782.51 (r/w/o: 1270.00/1314.50/198.00) lat (ms,95%): 78.60 err/s 0.40 reconn/s: 0.00
[ 460s ] thds: 4 tps: 95.70 qps: 2707.01 (r/w/o: 1237.70/1277.90/191.40) lat (ms,95%): 130.13 err/s 0.30 reconn/s: 0.00
[ 470s ] thds: 4 tps: 100.30 qps: 2821.10 (r/w/o: 1280.50/1340.00/200.60) lat (ms,95%): 127.81 err/s 0.70 reconn/s: 0.00
[ 480s ] thds: 4 tps: 100.80 qps: 2872.20 (r/w/o: 1309.90/1360.70/201.60) lat (ms,95%): 80.03 err/s 0.70 reconn/s: 0.00
[ 490s ] thds: 4 tps: 101.40 qps: 2869.10 (r/w/o: 1310.40/1355.90/202.80) lat (ms,95%): 77.19 err/s 0.10 reconn/s: 0.00
[ 500s ] thds: 4 tps: 94.20 qps: 2640.31 (r/w/o: 1206.40/1245.50/188.40) lat (ms,95%): 158.63 err/s 0.40 reconn/s: 0.00
[ 510s ] thds: 4 tps: 93.70 qps: 2746.60 (r/w/o: 1255.90/1303.30/187.40) lat (ms,95%): 132.49 err/s 0.30 reconn/s: 0.00
[ 520s ] thds: 4 tps: 97.20 qps: 2814.79 (r/w/o: 1281.50/1338.90/194.40) lat (ms,95%): 106.75 err/s 0.20 reconn/s: 0.00
[ 530s ] thds: 4 tps: 103.70 qps: 2881.81 (r/w/o: 1313.10/1361.30/207.40) lat (ms,95%): 80.03 err/s 0.50 reconn/s: 0.00
[ 540s ] thds: 4 tps: 99.80 qps: 2840.79 (r/w/o: 1301.20/1340.00/199.60) lat (ms,95%): 81.48 err/s 0.70 reconn/s: 0.00
[ 550s ] thds: 4 tps: 101.10 qps: 2953.70 (r/w/o: 1351.70/1399.80/202.20) lat (ms,95%): 75.82 err/s 0.50 reconn/s: 0.00
[ 560s ] thds: 4 tps: 102.50 qps: 2979.89 (r/w/o: 1362.69/1412.19/205.00) lat (ms,95%): 80.03 err/s 0.20 reconn/s: 0.00
[ 570s ] thds: 4 tps: 97.10 qps: 2793.50 (r/w/o: 1272.10/1327.20/194.20) lat (ms,95%): 87.56 err/s 0.70 reconn/s: 0.00
[ 580s ] thds: 4 tps: 102.80 qps: 2835.11 (r/w/o: 1294.61/1334.91/205.60) lat (ms,95%): 82.96 err/s 0.40 reconn/s: 0.00
[ 590s ] thds: 4 tps: 98.40 qps: 2782.99 (r/w/o: 1270.19/1315.99/196.80) lat (ms,95%): 116.80 err/s 0.40 reconn/s: 0.00
[ 600s ] thds: 4 tps: 97.00 qps: 2723.71 (r/w/o: 1239.70/1290.00/194.00) lat (ms,95%): 142.39 err/s 0.30 reconn/s: 0.00
[ 610s ] thds: 4 tps: 102.30 qps: 2905.10 (r/w/o: 1324.80/1375.80/204.50) lat (ms,95%): 77.19 err/s 0.50 reconn/s: 0.00
[ 620s ] thds: 4 tps: 99.60 qps: 2802.21 (r/w/o: 1274.60/1328.30/199.30) lat (ms,95%): 82.96 err/s 0.20 reconn/s: 0.00
[ 630s ] thds: 4 tps: 96.70 qps: 2784.28 (r/w/o: 1268.39/1322.49/193.40) lat (ms,95%): 95.81 err/s 0.20 reconn/s: 0.00
[ 640s ] thds: 4 tps: 101.00 qps: 2881.91 (r/w/o: 1313.50/1366.40/202.00) lat (ms,95%): 75.82 err/s 0.60 reconn/s: 0.00
[ 650s ] thds: 4 tps: 104.20 qps: 2966.79 (r/w/o: 1353.00/1405.40/208.40) lat (ms,95%): 75.82 err/s 0.70 reconn/s: 0.00
[ 660s ] thds: 4 tps: 100.10 qps: 2777.91 (r/w/o: 1270.10/1307.60/200.20) lat (ms,95%): 87.56 err/s 0.20 reconn/s: 0.00
[ 670s ] thds: 4 tps: 98.70 qps: 2740.99 (r/w/o: 1255.30/1288.30/197.40) lat (ms,95%): 108.68 err/s 0.60 reconn/s: 0.00
[ 680s ] thds: 4 tps: 103.40 qps: 2903.31 (r/w/o: 1323.01/1373.51/206.80) lat (ms,95%): 77.19 err/s 0.30 reconn/s: 0.00
[ 690s ] thds: 4 tps: 101.30 qps: 2863.90 (r/w/o: 1307.80/1353.50/202.60) lat (ms,95%): 80.03 err/s 0.30 reconn/s: 0.00
[ 700s ] thds: 4 tps: 97.00 qps: 2688.60 (r/w/o: 1226.90/1267.70/194.00) lat (ms,95%): 137.35 err/s 0.60 reconn/s: 0.00
[ 710s ] thds: 4 tps: 99.10 qps: 2780.90 (r/w/o: 1272.70/1310.00/198.20) lat (ms,95%): 81.48 err/s 0.40 reconn/s: 0.00
[ 720s ] thds: 4 tps: 99.90 qps: 2805.99 (r/w/o: 1282.80/1323.40/199.80) lat (ms,95%): 81.48 err/s 0.40 reconn/s: 0.00
[ 730s ] thds: 4 tps: 101.60 qps: 2919.60 (r/w/o: 1327.90/1388.50/203.20) lat (ms,95%): 77.19 err/s 0.90 reconn/s: 0.00
[ 740s ] thds: 4 tps: 101.90 qps: 2867.30 (r/w/o: 1304.90/1358.60/203.80) lat (ms,95%): 80.03 err/s 0.10 reconn/s: 0.00
[ 750s ] thds: 4 tps: 98.80 qps: 2837.01 (r/w/o: 1290.50/1348.91/197.60) lat (ms,95%): 82.96 err/s 0.60 reconn/s: 0.00
[ 760s ] thds: 4 tps: 98.30 qps: 2822.79 (r/w/o: 1287.00/1339.20/196.60) lat (ms,95%): 81.48 err/s 0.30 reconn/s: 0.00
[ 770s ] thds: 4 tps: 101.90 qps: 2851.40 (r/w/o: 1303.20/1344.40/203.80) lat (ms,95%): 74.46 err/s 0.40 reconn/s: 0.00
[ 780s ] thds: 4 tps: 100.30 qps: 2809.11 (r/w/o: 1285.10/1323.40/200.60) lat (ms,95%): 81.48 err/s 0.30 reconn/s: 0.00
[ 790s ] thds: 4 tps: 98.10 qps: 2775.90 (r/w/o: 1263.10/1316.60/196.20) lat (ms,95%): 116.80 err/s 0.40 reconn/s: 0.00
[ 800s ] thds: 4 tps: 100.80 qps: 2811.78 (r/w/o: 1282.59/1327.59/201.60) lat (ms,95%): 90.78 err/s 0.50 reconn/s: 0.00
[ 810s ] thds: 4 tps: 99.10 qps: 2782.32 (r/w/o: 1266.91/1317.21/198.20) lat (ms,95%): 94.10 err/s 0.40 reconn/s: 0.00
[ 820s ] thds: 4 tps: 94.70 qps: 2718.10 (r/w/o: 1240.60/1288.10/189.40) lat (ms,95%): 139.85 err/s 0.20 reconn/s: 0.00
[ 830s ] thds: 4 tps: 95.00 qps: 2754.60 (r/w/o: 1259.00/1305.60/190.00) lat (ms,95%): 134.90 err/s 0.30 reconn/s: 0.00
[ 840s ] thds: 4 tps: 103.40 qps: 2920.50 (r/w/o: 1328.20/1385.50/206.80) lat (ms,95%): 77.19 err/s 0.20 reconn/s: 0.00
[ 850s ] thds: 4 tps: 96.30 qps: 2738.10 (r/w/o: 1251.00/1294.50/192.60) lat (ms,95%): 110.66 err/s 0.60 reconn/s: 0.00
[ 860s ] thds: 4 tps: 98.20 qps: 2805.50 (r/w/o: 1277.90/1331.20/196.40) lat (ms,95%): 90.78 err/s 0.20 reconn/s: 0.00
[ 870s ] thds: 4 tps: 98.80 qps: 2884.60 (r/w/o: 1317.30/1369.70/197.60) lat (ms,95%): 78.60 err/s 0.20 reconn/s: 0.00
[ 880s ] thds: 4 tps: 102.20 qps: 2835.30 (r/w/o: 1292.40/1338.50/204.40) lat (ms,95%): 82.96 err/s 0.30 reconn/s: 0.00
[ 890s ] thds: 4 tps: 101.80 qps: 2804.10 (r/w/o: 1275.50/1325.00/203.60) lat (ms,95%): 92.42 err/s 0.60 reconn/s: 0.00
[ 900s ] thds: 4 tps: 95.60 qps: 2766.17 (r/w/o: 1261.79/1313.19/191.20) lat (ms,95%): 142.39 err/s 0.10 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            1159127
        write:                           1202950
        other:                           179076
        total:                           2541153
    transactions:                        89532  (99.47 per sec.)
    queries:                             2541153 (2823.21 per sec.)
    ignored errors:                      384    (0.43 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          900.0937s
    total number of events:              89532

Latency (ms):
         min:                                    1.60
         avg:                                   40.21
         max:                                  358.22
         95th percentile:                       87.56
         sum:                              3599985.04

Threads fairness:
    events (avg/stddev):           22383.0000/130.91
    execution time (avg/stddev):   899.9963/0.04

2020-04-27T02:46:34Z